# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Definition..::..Name Property
Definition Class See Also
---
The user visible name for the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract string Name { get; }
```

Visual Basic
---
```text
Public MustOverride ReadOnly Property Name As String
	Get
```

Visual C++
---
```text
public:
virtual property String^ Name {
	String^ get () abstract;
}
```

# See Also
Definition Class
Autodesk.Revit.DB Namespace